/////////////////////////////////////////////////////////////
//
// Author: попълнете името си тук
// FN: попълнете факултетния си номер тук
// Date: 6.01.2018
//

///
/// Структура, описваща възел в двоично дърво
///
struct Node {
  int x;
  Node* left;
  Node* right;
};

int count(Node const* t) {
  int result = 0;

  if (t->left) {
    result += 1;
  }
  if (t->right) {
    result += 1;
  }

  return result;
}

bool counter(Node const* t1, Node const* t2) {
  return (!t1 && !t2) ||
    (t1 && t2 && count(t1) == t2->x &&
    counter(t1->left, t2->left) &&
    counter(t1->right, t2->right));
}

// Да се дефинира функция 
// bool counter ([подходящ тип]t1, [подходящ тип]t2)
// която проверява дали дървото t2 е преброител на дървото t1.

//-------------------------------------------------------------------------
//
// ВАЖНО: Преди предаване на решението, моля премахнете коментара от дадения по-долу ред,
//        за да активирате автоматичните тестове за решението си.
//
//-------------------------------------------------------------------------
#include "prob10-tests.h"

#include "UnitTestFramework.h"

int main() {

  //-------------------------------------------------------------------------
  //
  // ВАЖНО: При предаване на работата във тялото на функцията main не трябва да се
  //        изпълнява нищо друго освен функцията RunTests().
  //
  //-------------------------------------------------------------------------
  RunTests();

  return 0;
}
